app/Controllers/Admin.php

SELECT *
FROM `admin`
WHERE `admin_email` = 'arun@gmail.com'
 LIMIT 1
---
    public function adminSignin()
    {
        $admin  = new adminModel;

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // $hpwd = password_hash($password, PASSWORD_DEFAULT);
        $hpwd = md5($password);


        $result['admin'] = $admin->where('admin_email', $email)->first();